import math

def area(r):
    """
    Возвращает площадь круга.

        Параметры:
                r (float): радиус круга.
   
        Возвращаемое значение:
                area (float): площадь круга.
       
        Пример вызова:
                >>> area(3)
                28.274333882308138

    """
    return math.pi * r * r


def perimeter(r):
    """
    Возвращает длинну окружности.

        Параметры:
                r (float): радиус круга.
   
        Возвращаемое значение:
                perimeter (float): длина окружности.
       
        Пример вызова:
                >>> perimeter(3)
                18.84955592153876

    """
    return 2 * math.pi * r
    