def area(a, b):
    """
    Возвращает площадь прямоугольника со сторонами a и b.

        Параметры:
                a (float): длина одной стороны прямоугольника.
                b (float): длина иной стороны прямоугольника.
   
        Возвращаемое значение:
                area (float): площадь прямоугольника.
       
        Пример вызова:
                >>> area(5, 6)
                30
                >>> area(2.5, 5.5)
                13.75
    """

    return a * b


def perimeter(a, b):
    """
    Возвращает периметр прямоугольника со сторонами a и b.

        Параметры:
                a (float): длина одной стороны прямоугольника.
                b (float): длина иной стороны прямоугольника.
   
        Возвращаемое значение:
                perimeter (float): периметр прямоуольника.
       
        Пример вызова:
                >>> perimeter(5, 7)
                24
                >>> perimeter(2.25, 5.5)
                16.1

    """
    return 2*(a + b)
