def area(a):
    """
    Возвращает площадь квадрата.

        Параметры:
                a (float): длина стороны квадрата.
   
        Возвращаемое значение:
                area (float): площадь квадрата.
       
        Пример вызова:
                >>> area(5)
                25
                >>> area(2.5)
                6.25
    """
    return a * a

def perimeter(a):
    """
    Возвращает периметр квадрата.

        Параметры:
                a (float): длина стороны квадрата.
   
        Возвращаемое значение:
                area (float): периметр квадрата.
       
        Пример вызова:
                >>> perimeter(5)
                20
                >>> perimeter(2.5)
                10.0

    """
    return 4 * a
