def area(a, h):
        """
    Возвращает площадь треугольника.

        Параметры:
                a (float): длина основания треугольника.
                h (float): длина высоты опущенной на это основание.
   
        Возвращаемое значение:
                area (float): площадь треугольника.
       
        Пример вызова:
                >>> area(5, 6)
                30
                >>> area(2.5, 4.5)
                5.625
    """
    return a * h / 2
 
def perimeter(a, b, c):
    """
    Возвращает периметр треугольника.

        Параметры:
                a (float): первая сторона треугольника.
                b (float): вторая сторона треугольника.
                c (float): третья сторона треугольника.
   
        Возвращаемое значение:
                area (float): периметр треугольника.
       
        Пример вызова:
                >>> perimeter(5, 4, 3)
                12
                >>> perimeter(2.5, 2.5, 1.5)
                6.5

    """
    return a + b + c
